load-testing/artillery-config.yml
# Artillery Load Test Configuration for SSE Endpoint
# 
# Install: npm install -g artillery
# Usage: artillery run artillery-config.yml
#
# Environment variables:
#   BASE_URL: API base URL (default: http://localhost:3000)
#   TOKEN: Bearer token for authentication
#   SEARCH_FILTER_ID: Search filter ID to use

config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:3000' }}"
  phases:
    # Warm-up phase
    - duration: 10
      arrivalRate: 1
      name: "Warm up"
    
    # Ramp up phase
    - duration: 30
      arrivalRate: 2
      rampTo: 10
      name: "Ramp up load"
    
    # Sustained load phase
    - duration: 60
      arrivalRate: 10
      name: "Sustained load"
    
    # Spike test
    - duration: 10
      arrivalRate: 50
      name: "Spike test"
    
    # Cool down
    - duration: 20
      arrivalRate: 5
      name: "Cool down"
  
  processor: "./artillery-processor.js"
  variables:
    token: "{{ $processEnvironment.TOKEN }}"
    searchFilterId: "{{ $processEnvironment.SEARCH_FILTER_ID }}"
    message: "generate search parameters"
  
  payload:
    # You can use a CSV file for different test data
    # path: "./test-data.csv"
    # fields:
    #   - "searchFilterId"
    #   - "message"
  
  plugins:
    expect: {}
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "SSE Stream Test"
    weight: 100
    flow:
      - post:
          url: "/candidate-search/message/stream"
          headers:
            Content-Type: "application/json"
            Authorization: "Bearer {{ token }}"
            Accept: "text/event-stream"
            Cache-Control: "no-cache"
          json:
            searchFilterId: "{{ searchFilterId }}"
            message: "{{ message }}"
            parsedJD:
              jobTitle: "Software Engineer"
              company: "Tech Corp"
              location: "San Francisco, CA"
              industry: "Technology"
              requiredSkills: ["JavaScript", "TypeScript", "React"]
              preferredSkills: ["Node.js", "GraphQL"]
              experienceLevel: "mid_level"
              education: ["Bachelor's Degree"]
              keywords: ["software", "engineer", "developer"]
              responsibilities: ["Develop web applications", "Write clean code"]
              qualifications: ["3+ years experience", "Strong problem-solving skills"]
              benefits: ["Health insurance", "Remote work"]
              employmentType: "full_time"
              remoteWork: true
              salaryRange: null
            searchType: "classic"
            searchCategory: "people"
            sampleResults: []
            dataDistribution: {}
          capture:
            - json: "$.type"
              as: "responseType"
          expect:
            - statusCode: 200
            - contentType: "text/event-stream"
          think: 1